import json

from typess import Availability, TimeSlot

def get_json_dict(path):
    with open(path, "r", encoding='utf-8') as f:
        return json.load(f)

BERUF_DICT = get_json_dict("data/beruf-akkordeon.json")
BRANCH_DICT = {
    "9": "Роздрібна, оптова та зовнішня торгівля.",
    "1": "Будівництво, архітектура.",
    "10": "Готелі, ресторани, туризм, мистецтво, культура, дозвілля.",
    "15": "Металообробка, машинобудування, будівництво обладнання.",
    "29": "Інші послуги.",
    "21": "Логістика, транспорт.",
    "23": "Охоронні, клінінгові або ремонтні послуги.",
    "5": "Виробництво та обслуговування транспортних засобів.",
    "17": "Виробництво продуктів харчування.",
    "8": "Обробка сировини, скло, кераміка, пластик, дерево.",
    "19": "Папір, друк, упаковка.",
    "16": "Споживчі та промислові товари.",
    "27": "Приватне працевлаштування.",
    "22": " Відходи, енергопостачання, водопостачання."
}

AVAIL_DICT = {
    Availability.FULL_TIME.value: "Vollzeit (Повна зайнятість)."
}

TIME_DICT = {
    TimeSlot.TODAY.value: "За останні 24 години.",
    TimeSlot.YESTERDAY.value: "Зі вчора.",
    TimeSlot.WEEK1.value: " За останній тиждень.",
    TimeSlot.WEEK2.value: " За останні 2 тижні.",
    TimeSlot.WEEK4.value: " За останній місяць."
}